# **Melt Function**

* Reshapes data from **wide format** to **long format**
* The melt function is the "Un-Pivoter". It changes your data from **Wide Format (good for humans)** to **Long Format (good for machines/plotting)**.

In [1]:
import  pandas as pd

In [4]:
df=pd.DataFrame({"Days":[1,2,3,4,5,6],"Eng":[12,34,23,53,64,63],"Maths":[33,52,51,20,83,24],"Science":[53,45,24,64,22,74]})
df

   Days  Eng  Maths  Science
0     1   12     33       53
1     2   34     52       45
2     3   23     51       24
3     4   53     20       64
4     5   64     83       22
5     6   63     24       74

## `melt()`

**Basic Syntax :**
```python
pd.melt(
    df,
    id_vars=['id_column1', 'id_column2'],   # columns to keep fixed
    value_vars=['col1','col2'],             # columns to unpivot
    var_name='Variable',                    # name for new column
    value_name='Value'                      # name for values
)
```

In [17]:
pd.melt(df,id_vars=['Days'])
pd.melt(df,id_vars=['Days'],value_vars=['Maths','Eng'])
pd.melt(df,id_vars=['Days'],var_name='Python',value_name='Java')
pd.melt(df,id_vars=['Days'],value_vars=['Maths','Eng'],var_name='Python',value_name='Java')

    Days Python  Java
0      1  Maths    33
1      2  Maths    52
2      3  Maths    51
3      4  Maths    20
4      5  Maths    83
5      6  Maths    24
6      1    Eng    12
7      2    Eng    34
8      3    Eng    23
9      4    Eng    53
10     5    Eng    64
11     6    Eng    63